{
    "Home":"Início",
    "About": "Quem sou",
    "Stacks": "Tecnologias",
    "Projects": "Projetos",
    "Contact": "Contato",
    "Resume": "Currículo",
    "Hi, my name is": "Olá, meu nome é",
    "I can help you build a system, feature, or website. Look through some of my work and experience. Whether you're seeking to expand your development team or have a project you'd like to discuss, ": "Posso ajudar você a desenvolver um sistema, recurso ou site. Dê uma olhada em alguns dos meus trabalhos e experiência. Seja para expandir a sua equipe de desenvolvimento ou para discutir um projeto, ",
    "if you like what you see, feel free to contact me. I am available for hire.": "se você gostar do que vê, sinta-se à vontade para entrar em contato comigo. Estou disponível para contratação.",
    "Check out my work":"Confira o meu trabalho",
    "About Me": "Quem sou",
    "Hello! My name is": "Olá! Meu nome é",
    "and I'm a Computer Science Student, Full Stack Developer and Bachelor in Product Design. I thoroughly enjoy working as a ": "e sou estudante de Ciência da Computação, Desenvolvedor Full Stack e Bacharel em Design de Produtos. Tenho grande satisfação em trabalhar como ",
    "Full Stack Developer": "Desenvolvedor Full Stack",
    ", yet I find myself equally at ease working on just one of the stacks, either as a Front-End Developer or as a Back-End Developer.": ", mas também me sinto muito à vontade ao trabalhar em apenas uma das stacks, seja como Desenvolvedor Front End ou como Desenvolvedor Back End.",
    "In the realm of Front End development": "Relacionado ao desenvolvimento Front End",
    " : I have a genuine passion for crafting appealing applications that also prioritize usability and User Experience.": ", possuo grande tato e um entusiasmo sincero em desenvolver aplicações visualmente atrativas, e que primam tanto pela usabilidade quanto pela Experiência do Usuário.",
    "As for the Back End": "No que diz respeito ao Back End",
    ", being a foundational element in the overall development process, I am captivated by the responsibility of building, expanding, and maintaining robust, clear, and integrated server-sideapplications.": ", sendo um elemento fundamental no processo geral de desenvolvimento, sou cativado pela responsabilidade de construir, expandir e manter aplicações robustas, claras e integradas no lado do servidor.",
    "As a Designer": "Enquanto Designer",
    ", I have accumulated over 10 years of professional experience, directly responsible for designing, managing, and executing numerous projects for individuals, businesses, and companies.":   ", acumulo mais de 10 anos de experiência profissional, sendo diretamente responsável pelo projeto, gerenciamento e execução de inúmeros projetos para clientes individuais,  corporativos e instituições.",
    "My main aim is to create and deliver high-end and innovative products for a variety of clients. If you are in need of an Software Developer, I am": "Meu principal objetivo é criar e entregar produtos inovadores e de alta qualidade para uma variedade de clientes. Se você está precisando de um Desenvolvedor de Software, estou",
    "available for hire.": "disponível para contratação.",
    "ARE YOU SEEKING TO EXPAND YOUR DEVELOPMENT TEAM OR HAVE A PROJECT YOU'D LIKE TO DISCUSS, I'D LOVE TO ": "ESTÁ PROCURANDO AMPLIAR SUA EQUIPE DE DESENVOLVIMENTO OU TEM UM PROJETO QUE GOSTARIA DE DISCUTIR? ",
    "HEAR ABOUT IT": "CONTE-ME SOBRE",
    "Featured Projects": "Projetos em Destaque",
    "Contact Me": "Contate-me",
    "If you are interested in ": "Se você tem interesse em ",
    "developing": "desenvolver",
    " a system, have a feature that you need built or have a project that needs ": " um sistema, possui um recurso que precisa ser construído ou um projeto que necessita de ",
    "coding": "código",
    ". I'd love to help you with it!": ", ficarei feliz em te ajudar com isto!",
    "Name": "Nome",
    "Full Name": "Nome completo",
    "E-mail address": "Endereço de E-mail ",
    "Message": "Mensagem",
    "Type your message here...": "Escreva a sua mensagem aqui...",
    "Send": "Envie",
    "PokéVerse": "PokéVerso",
    "Burger Shop - V2": "Hamburgueria - V2",
    "K-Books is a system designed to efficiently manage both physical and digital libraries. Through K-Books, it's also possible to provide readers access to digital editions of books and various documents in PDF format, enhancing the library experience.": "K-Books é um sistema projetado para gerenciar de forma eficiente bibliotecas físicas e digitais. Com o K-Books, você também pode oferecer aos leitores acesso a edições digitais de livros e outros documentos em formato PDF, aprimorando a experiência da biblioteca.",
    "BandKamp is a system designed to streamline the management of users, albums, and songs. It enables users to log in, create, update, and delete their own albums and songs in a practical and efficient manner.": "BandKamp é um sistema criado para facilitar o gerenciamento de usuários, álbuns e músicas. Ele permite que os usuários façam login, criem, atualizem e excluam seus próprios álbuns e músicas de forma prática e eficiente.",
    "The purpose of the PokéVerse is to visually and engagingly showcase the Pokémon universe to both newcomers and enthusiasts. It houses the complete collection of over 1,000 existing Pokémon.": "O objetivo do PokéVerso é apresentar de forma gráfica e interessante o universo Pokémon, tanto para leigos quanto para os seus amantes. Está centralizado nele a coleção completa de mais de 1.000 Pokémon existentes.",
    "K.Hub is a web application that enables developers to register the technologies in which they have expertise or are learning, assisting them in tracking their progress and proficiency levels within each registered technology.": "K.Hub é uma aplicação web que possibilita aos desenvolvedores registrarem as tecnologias nas quais têm habilidade ou que estão aprendendo, auxiliando-os a acompanhar sua trilha de progresso e níveis de proficiência dentro de cada  tecnologia cadastrada.",
    "This second version of the Burger Shop application not only encompasses the foundational Front End system for product presentation, selection, addition, and order calculation within the shopping cart but also includes customer registration and an exclusive session for each client.": "Esta segunda versão da aplicação web Burger Shop, além de abranger o sistema base no Front End para apresentação de produtos, escolha, adição e cálculo dos pedidos adicionados ao carrinho de compras, abrange também o cadastro de clientes e uma sessão exclusiva para cada cliente."
}