{
    "Home":"Início",
    "About": "Quem sou",
    "Stacks": "Tecnologias",
    "Projects": "Projetos",
    "Contact": "Contato",
    "Resume": "Currículo",
    "Hi, my name is": "Olá, meu nome é",
    "I am a ": "Sou ",
    "Developer ": "Programador ",
    "and ": "e ",
    "Designer": "Designer",
    "As a Developer (Front-end | Back-end), I develop web and mobile applications with a focus on efficiency, scalability, and technical robustness.": "Como Programador (Front-end | Back-end), desenvolvo aplicações para web e dispositivos móveis (apps), com foco em eficiência, escalabilidade e robustez técnica.",
    "As a Developer, I develop web and mobile applications with a focus on efficiency, scalability, and technical robustness.": "Como Programador, desenvolvo aplicações para web e dispositivos móveis (apps), com foco em eficiência, escalabilidade e robustez técnica.",
    "As a Designer (Products | UI | UX | Branding), I plan, create, and deliver digital projects that effectively align with business objectives, balancing aesthetics, functionality, and a high-quality user experience.": "Enquanto Designer (Produtos | UI | UX | Branding), planejo, crio e entrego projetos digitais que expressem e atendam da melhor forma os objetivos de negócio, equilibrando estética, funcionalidade e uma experiência de qualidade para os usuários.",
    "Do you need a professional to develop a system, app, or interface? ": "Precisa de um profissional para desenvolver algum sistema, app ou interface? ",
    "I am available to assist you.": "Estou disponível para te atender.",
    "Check out my work":"Confira o meu trabalho",
    "About Me": "Quem sou",
    "My name is": "Meu nome é",
    ", I'm a Full Stack Developer, Computer Science Student and Bachelor in Product Design.": ", sou Desenvolvedor Full Stack, estudante da Ciência da Computação e Bacharel em Design de Produtos.",
    ", I'm a Front-End Developer, Computer Science Student and Bachelor in Product Design.": ", sou Desenvolvedor Front-End, estudante da Ciência da Computação e Bacharel em Design de Produtos.",
    "As a Developer:": "Enquanto Programador:",
    " I have experience with modern front-end technologies, including React, React Native, TypeScript, and CSS frameworks, as well as familiarity in basic test writing using tools such as Jest, React Testing Library, and Playwright, along with CI/CD pipelines. I bring a strong sense of responsibility and a growth-oriented mindset. Additionally, I excel at working independently and autonomously while thriving in collaborative environments. My focus is on developing robust, efficient, and scalable systems and applications for both web and mobile platforms. I place technical efficiency at the core of my work, ensuring the final product meets business demands with quality and reliability.":" Possuo experiência com tecnologias modernas de front-end, incluindo React, React Native, TypeScript e frameworks CSS e familiaridade com escrita básica de testes utilizando ferramentas como Jest, React Testing Library e Playwright, bem como com pipelines de CI/CD. Tenho um forte senso de responsabilidade e uma mentalidade voltada para o crescimento contínuo. Além disso, sou capaz de trabalhar de forma independente e autônoma, mas também me destaco em ambientes colaborativos. Tenho como foco desenvolver sistemas e aplicativos robustos, eficientes e escaláveis, seja para web ou para dispositivos móveis. Coloco a eficiência técnica no centro do meu trabalho, garantindo que o produto final atenda às demandas do negócio com qualidade e confiabilidade.",
    " Development of optimized applications for Android and iOS, with a focus on performance and compatibility.":" Desenvolvimento de aplicativos otimizados para Android e iOS, com foco em desempenho e compatibilidade.",
    " Creation of responsive and functional interfaces tailored to user needs.":" Desenvolvimento de interfaces responsivas e funcionais que se adaptam às necessidades do usuário.",
    " Back-end development focused on building robust APIs and solid infrastructure, ensuring high performance and security using technologies such as PostgreSQL, Express, NestJS, and Prisma.":" Criação e manutenção de APIs utilizando tecnologias como PostgreSQL, Express, NestJS e Prisma.",
    "As a Designer:":"Enquanto Designer:",
    " My mission is to craft engaging digital experiences aligned with both user and business needs. I transform concepts into captivating experiences by putting the user and the message at the center of every decision.":" Minha missão é criar experiências digitais envolventes e alinhadas às necessidades dos usuários e do negócio. Transformo conceitos em experiências cativantes, colocando o usuário e a mensagem no centro de cada decisão.",
    " Designing intuitive interfaces that prioritize usability and aesthetics.":" Design de interfaces intuitivas que priorizam a usabilidade e a estética.",
    " • Products:":" • Produtos:",
    " Strategizing and developing digital solutions that connect technology with purpose.":" Estratégia e desenvolvimento de soluções digitais que conectem tecnologia e propósito.",
    " Enhancing visual identity to create memorable and coherent brands.":" Fortalecimento da identidade visual para criar marcas memoráveis e coerentes.",

    "Full Stack Developer": "Desenvolvedor Full Stack",
    ", yet I find myself equally at ease working on just one of the stacks, either as a Front-End Developer or as a Back-End Developer.": ", mas também me sinto muito à vontade ao trabalhar em apenas uma das stacks, seja como Desenvolvedor Front End ou como Desenvolvedor Back End.",
    "In the realm of Front End development": "Relacionado ao desenvolvimento Front End",
    " : I have a genuine passion for crafting appealing applications that also prioritize usability and User Experience.": ", possuo grande tato e um entusiasmo sincero em desenvolver aplicações visualmente atrativas, e que primam tanto pela usabilidade quanto pela Experiência do Usuário.",
    "As for the Back End": "No que diz respeito ao Back End",
    ", being a foundational element in the overall development process, I am captivated by the responsibility of building, expanding, and maintaining robust, clear, and integrated server-sideapplications.": ", sendo um elemento fundamental no processo geral de desenvolvimento, sou cativado pela responsabilidade de construir, expandir e manter aplicações robustas, claras e integradas no lado do servidor.",
    "As a Designer": "Enquanto Designer",
    ", I have accumulated over 10 years of professional experience, directly responsible for designing, managing, and executing numerous projects for individuals, businesses, and companies.":   ", acumulo mais de 10 anos de experiência profissional, sendo diretamente responsável pelo projeto, gerenciamento e execução de inúmeros projetos para clientes individuais,  corporativos e instituições.",
    "My main aim is to create and deliver high-end and innovative products for a variety of clients. If you are in need of an Software Developer,": "Meu principal objetivo é criar e entregar produtos inovadores e de alta qualidade para uma variedade de clientes. Se você está precisando de um Desenvolvedor de Software,",
    "I am available for hire.": "estou disponível para contratação.",
    "Are you looking to expand your development team or need a professional to build a system, app, or interface?":"Está procurando ampliar sua equipe de desenvolvimento ou precisa de um profissional para desenvolver algum sistema, app ou interface?",
    "Are you looking to ":"Está procurando ",
    "expand your development team":"ampliar sua equipe de desenvolvimento",
    " or ": " ou ",
    "need a professional to build a system":"precisa de um profissional para desenvolver algum sistema",
    "interface":"interface",
    "ARE YOU SEEKING TO EXPAND YOUR DEVELOPMENT TEAM OR HAVE A PROJECT YOU'D LIKE TO DISCUSS, I'D LOVE TO ": "ESTÁ PROCURANDO AMPLIAR SUA EQUIPE DE DESENVOLVIMENTO OU TEM UM PROJETO QUE GOSTARIA DE DISCUTIR? ",
    "HEAR ABOUT IT": "CONTE-ME SOBRE",
    "Featured Projects": "Projetos em Destaque",
    "Contact Me": "Contate-me",
    "If you are interested in ": "Se você tem interesse em ",
    "developing": "desenvolver",
    " a system, have a feature that you need built or have a project that needs ": " um sistema, possui um recurso que precisa ser construído ou um projeto que necessita de ",
    "coding": "código",
    ". I'd love to help you with it!": ", ficarei feliz em te ajudar com isto!",
    "Name": "Nome",
    "Full Name": "Nome completo",
    "E-mail address": "Endereço de E-mail ",
    "Message": "Mensagem",
    "Type your message here...": "Escreva a sua mensagem aqui...",
    "Send": "Enviar",
    "PokéVerse": "PokéVerso",
    "Burger Shop - V2": "Hamburgueria - V2",
    "Flex Future is a Brazilian platform for the consultation and registration of companies. Through Flex Future, it is possible to search for companies and discover information about their work models (hybrid, remote, in-person), location, size, sector, and much more.": "Flex Future é uma plataforma Brasileira para consulta e cadastro de empresas. Através da Flex Future é possível pesquisar por empresas e descobrir informações sobre seus modelos de trabalho (híbrido, remoto, presencial), localização, tamanho, setor e muito mais.",
    "K-Books is a system designed to efficiently manage both physical and digital libraries. Through K-Books, it's also possible to provide readers access to digital editions of books and various documents in PDF format, enhancing the library experience.": "K-Books é um sistema projetado para gerenciar de forma eficiente bibliotecas físicas e digitais. Com o K-Books, você também pode oferecer aos leitores acesso a edições digitais de livros e outros documentos em formato PDF, aprimorando a experiência da biblioteca.",
    "BandKamp is a system designed to streamline the management of users, albums, and songs. It enables users to log in, create, update, and delete their own albums and songs in a practical and efficient manner.": "BandKamp é um sistema criado para facilitar o gerenciamento de usuários, álbuns e músicas. Ele permite que os usuários façam login, criem, atualizem e excluam seus próprios álbuns e músicas de forma prática e eficiente.",
    "The purpose of the PokéVerse is to visually and engagingly showcase the Pokémon universe to both newcomers and enthusiasts. It houses the complete collection of over 1,000 existing Pokémon.": "O objetivo do PokéVerso é apresentar de forma gráfica e interessante o universo Pokémon, tanto para leigos quanto para os seus amantes. Está centralizado nele a coleção completa de mais de 1.000 Pokémon existentes.",
    "K.Hub is a web application that enables developers to register the technologies in which they have expertise or are learning, assisting them in tracking their progress and proficiency levels within each registered technology.": "K.Hub é uma aplicação web que possibilita aos desenvolvedores registrarem as tecnologias nas quais têm habilidade ou que estão aprendendo, auxiliando-os a acompanhar sua trilha de progresso e níveis de proficiência dentro de cada  tecnologia cadastrada.",
    "This second version of the Burger Shop application not only encompasses the foundational Front End system for product presentation, selection, addition, and order calculation within the shopping cart but also includes customer registration and an exclusive session for each client.": "Esta segunda versão da aplicação web Burger Shop, além de abranger o sistema base no Front End para apresentação de produtos, escolha, adição e cálculo dos pedidos adicionados ao carrinho de compras, abrange também o cadastro de clientes e uma sessão exclusiva para cada cliente."
}